Repository: overpolish/keyframeless
Catalog: Mirage/Mirage/Plugin/MirageUI.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, zh_hans

source: Foliage is slightly too yellow.
de: Das Laub ist etwas zu gelb.
es: La vegetación tira un poco a amarillo.
fr: Le feuillage tire un peu trop vers le jaune.
ja: 緑がやや黄色すぎます。
ko: 초목 색이 약간 너무 노랗습니다.
zh_hans: 植物颜色略微偏黄。

source: Foliage looks right.
de: Das Laub sieht richtig aus.
es: La vegetación se ve bien.
fr: Le feuillage est correct.
ja: 緑は良好です。
ko: 초목 색이 적절합니다.
zh_hans: 植物颜色正常。

source: Four numbers, xyzw or rgba.
de: Vier Zahlen, xyzw oder rgba.
es: Cuatro números, xyzw o rgba.
fr: Quatre nombres, xyzw ou rgba.
ja: 4つの数値（xyzw または rgba）。
ko: 네 숫자(xyzw 또는 rgba)입니다.
zh_hans: 四个数字，xyzw 或 rgba。

source: Frame width over height. Multiply x by this to correct for shape.
de: Bildbreite geteilt durch Höhe. Multipliziere x damit, um die Form zu korrigieren.
es: Ancho del fotograma dividido por su alto. Multiplica x por esto para corregir la forma.
fr: Largeur de l'image divisée par la hauteur. Multipliez x par ceci pour corriger la forme.
ja: フレームの幅÷高さ。x にこれを掛けて形状を補正します。
ko: 프레임 너비 나누기 높이입니다. x 에 이 값을 곱해 형태를 보정합니다.
zh_hans: 画面宽度除以高度。将 x 乘以它以校正形状。

source: Frames per second.
de: Bilder pro Sekunde.
es: Fotogramas por segundo.
fr: Images par seconde.
ja: 1秒あたりのフレーム数。
ko: 초당 프레임 수입니다.
zh_hans: 每秒帧数。

source: Green
de: Grün
es: Verde
fr: Vert
ja: 緑
ko: 초록
zh_hans: 绿

source: Group values into a custom type.
de: Fasst Werte zu einem eigenen Typ zusammen.
es: Agrupa valores en un tipo personalizado.
fr: Regroupe des valeurs dans un type personnalisé.
ja: 値をまとめてカスタム型にします。
ko: 값들을 사용자 지정 형식으로 묶습니다.
zh_hans: 将多个值组合成自定义类型。

source: Hand a result back from a function.
de: Gibt ein Ergebnis aus einer Funktion zurück.
es: Devuelve un resultado desde una función.
fr: Renvoie un résultat depuis une fonction.
ja: 関数から結果を返します。
ko: 함수에서 결과를 돌려줍니다.
zh_hans: 从函数返回一个结果。

source: Handle look: hollow, square or dot.
de: Griffdarstellung: hohl, Quadrat oder Punkt.
es: Aspecto del controlador: hueco, cuadrado o punto.
fr: Aspect de la poignée : creux, carré ou point.
ja: ハンドルの見た目: 中空、四角、点。
ko: 핸들 모양새: 빈 링, 사각형 또는 점.
zh_hans: 控制柄外观：空心、方块或圆点。

source: Highest allowed value.
de: Höchster zulässiger Wert.
es: Valor máximo permitido.
fr: Valeur maximale autorisée.
ja: 許可される最大値。
ko: 허용되는 최대값입니다.
zh_hans: 允许的最大值。

source: Hold to see the frame without this effect.
de: Halte die Taste gedrückt, um das Bild ohne diesen Effekt zu sehen.
es: Mantén pulsado para ver el fotograma sin este efecto.
fr: Maintenez le bouton enfoncé pour voir l'image sans cet effet.
ja: 押している間、このエフェクトを適用していない画面を表示します。
ko: 누르고 있는 동안 이 효과가 적용되지 않은 화면을 표시합니다.
zh_hans: 按住可查看未应用此效果的画面。

source: How do I turn a uniform into an on-screen control?
de: Wie mache ich aus einem Uniform eine Bildschirmsteuerung?
es: ¿Cómo convierto un uniform en un control en pantalla?
fr: Comment transformer un uniform en contrôle à l'écran ?
ja: uniform をオンスクリーンコントロールにするには？
ko: uniform을 화면 컨트롤로 만들려면?
zh_hans: 如何将 uniform 变成屏幕控件？

source: How do controls work?
de: Wie funktionieren Steuerungen?
es: ¿Cómo funcionan los controles?
fr: Comment fonctionnent les commandes ?
ja: コントロールの仕組みは？
ko: 컨트롤은 어떻게 작동하나요?
zh_hans: 控件如何工作？

source: How fast a value changes across the screen, left to right.
de: Wie schnell sich ein Wert über den Bildschirm ändert, links nach rechts.
es: Con qué rapidez cambia un valor por la pantalla, de izquierda a derecha.
fr: À quelle vitesse une valeur change sur l'écran, de gauche à droite.
ja: 画面上で値がどれだけ速く変化するか（左から右）。
ko: 화면에서 값이 얼마나 빨리 변하는지(왼쪽에서 오른쪽).
zh_hans: 值在屏幕上从左到右变化的速度。

source: How fast a value changes across the screen, top to bottom.
de: Wie schnell sich ein Wert über den Bildschirm ändert, oben nach unten.
es: Con qué rapidez cambia un valor por la pantalla, de arriba a abajo.
fr: À quelle vitesse une valeur change sur l'écran, de haut en bas.
ja: 画面上で値がどれだけ速く変化するか（上から下）。
ko: 화면에서 값이 얼마나 빨리 변하는지(위에서 아래).
zh_hans: 值在屏幕上从上到下变化的速度。

source: How fast a value changes between neighbouring pixels, for anti-aliasing.
de: Wie schnell sich ein Wert zwischen Nachbarpixeln ändert, für Kantenglättung.
es: Con qué rapidez cambia un valor entre píxeles vecinos, para el suavizado.
fr: À quelle vitesse une valeur change entre pixels voisins, pour l'anticrénelage.
ja: 隣接ピクセル間で値がどれだけ速く変化するか。アンチエイリアス用。
ko: 인접 픽셀 사이에서 값이 얼마나 빨리 변하는지로, 안티앨리어싱에 사용합니다.
zh_hans: 值在相邻像素之间变化的速度，用于抗锯齿。

source: Introduction
de: Einführung
es: Introducción
ja: はじめに
ko: 소개
zh_hans: 简介

source: Inverse cosine, gives an angle.
de: Arkuskosinus, ergibt einen Winkel.
es: Arcocoseno, da un ángulo.
fr: Arc cosinus, donne un angle.
ja: 逆コサイン。角度を返します。
ko: 역코사인으로, 각도를 반환합니다.
zh_hans: 反余弦，返回一个角度。

source: Inverse sine, gives an angle.
de: Arkussinus, ergibt einen Winkel.
es: Arcoseno, da un ángulo.
fr: Arc sinus, donne un angle.
ja: 逆サイン。角度を返します。
ko: 역사인으로, 각도를 반환합니다.
zh_hans: 反正弦，返回一个角度。

source: Keep a value within a low and high bound.
de: Hält einen Wert innerhalb einer unteren und oberen Grenze.
es: Mantiene un valor dentro de un límite inferior y superior.
fr: Maintient une valeur entre une borne basse et haute.
ja: 値を下限と上限の範囲内に収めます。
ko: 값을 하한과 상한 사이로 유지합니다.
zh_hans: 将值限制在下限和上限之间。

source: Keep the two fields in proportion.
de: Die zwei Felder im Verhältnis halten.
es: Mantiene los dos campos en proporción.
fr: Garde les deux champs en proportion.
ja: 2つのフィールドの比率を保つ。
ko: 두 필드의 비율을 유지합니다.
zh_hans: 使两个字段保持比例。

source: Left-right resize.
de: Größe ändern links-rechts.
es: Redimensionar izquierda-derecha.
fr: Redimensionnement gauche-droite.
ja: 左右のサイズ変更。
ko: 좌우 크기 조절입니다.
zh_hans: 左右调整大小。

source: Line %ld: %@
de: Zeile %ld: %@
es: Línea %ld: %@
fr: Ligne %ld : %@
ja: %ld 行目: %@
ko: %ld번째 줄: %@
zh_hans: 第 %ld 行：%@

source: Logarithm base 2.
de: Logarithmus zur Basis 2.
es: Logaritmo en base 2.
fr: Logarithme en base 2.
ja: 底が2の対数。
ko: 밑이 2인 로그입니다.
zh_hans: 以 2 为底的对数。

source: Lowest allowed value.
de: Niedrigster zulässiger Wert.
es: Valor mínimo permitido.
fr: Valeur minimale autorisée.
ja: 許可される最小値。
ko: 허용되는 최소값입니다.
zh_hans: 允许的最小值。

source: Make a point from an x and a y.
de: Erzeugt einen Punkt aus einem x und einem y.
es: Crea un punto a partir de una x y una y.
fr: Crée un point à partir d'un x et d'un y.
ja: x と y から点を作ります。
ko: x 와 y 로 점을 만듭니다.
zh_hans: 由 x 和 y 生成一个点。

source: Make a rectangle from two corner points.
de: Ein Rechteck aus zwei Eckpunkten bilden.
es: Crea un rectángulo a partir de dos esquinas.
fr: Construit un rectangle à partir de deux coins.
ja: 2つの角の点から矩形を作る。
ko: 두 모서리 점으로 사각형을 만듭니다.
zh_hans: 由两个角点构成矩形。

source: Mirage failed to compile
de: Mirage konnte nicht kompiliert werden
es: No se pudo compilar el shader
fr: Échec de la compilation du shader
ja: シェーダーのコンパイルに失敗しました
ko: 셰이더 컴파일 실패
zh_hans: 着色器编译失败

source: Move the pattern's origin on the canvas
de: Verschiebe den Ursprung des Musters auf der Leinwand
es: Mueve el origen del patrón en el lienzo
fr: Déplacez l'origine du motif sur le canevas
ja: キャンバス上でパターンの原点を移動
ko: 캔버스에서 패턴의 원점을 이동
zh_hans: 在画布上移动图案的原点

source: Feedback shaders can't use the default motion blur - add `// #motionblur native` to blur it yourself, or `// #motionblur off` to hide the control
de: Feedback-Shader können die Standard-Bewegungsunschärfe nicht verwenden: Füge `// #motionblur native` hinzu, um sie selbst zu berechnen, oder `// #motionblur off`, um das Steuerelement auszublenden
es: Los shaders con retroalimentación no pueden usar el desenfoque de movimiento predeterminado: añade `// #motionblur native` para aplicarlo tú mismo, o `// #motionblur off` para ocultar el control
fr: Les shaders à rétroaction ne peuvent pas utiliser le flou de mouvement par défaut : ajoutez `// #motionblur native` pour le gérer vous-même, ou `// #motionblur off` pour masquer la commande
ja: フィードバックシェーダーは標準のモーションブラーを使用できません。自分でぼかす場合は `// #motionblur native` を、コントロールを非表示にする場合は `// #motionblur off` を追加してください
ko: 피드백 셰이더는 기본 모션 블러를 사용할 수 없습니다. 직접 처리하려면 `// #motionblur native`를, 컨트롤을 숨기려면 `// #motionblur off`를 추가하세요
zh_hans: 反馈着色器无法使用默认运动模糊，请添加 `// #motionblur native` 自行处理，或添加 `// #motionblur off` 以隐藏该控件

source: Names for each number of a #multi control.
de: Namen für jede Zahl eines #multi-Steuerelements.
es: Nombres para cada número de un control #multi.
fr: Noms pour chaque nombre d'une commande #multi.
ja: #multi コントロールの各数値の名前。
ko: #multi 컨트롤의 각 숫자에 대한 이름입니다.
zh_hans: #multi 控件中每个数字的名称。

source: Natural logarithm.
de: Natürlicher Logarithmus.
es: Logaritmo natural.
fr: Logarithme naturel.
ja: 自然対数。
ko: 자연로그입니다.
zh_hans: 自然对数。

source: No keypose at the current frame
de: Keine Keypose im aktuellen Frame
es: Sin keypose en el fotograma actual
fr: Aucune keypose sur l’image actuelle
ja: 現在のフレームにキーポーズがありません
ko: 현재 프레임에 키포즈가 없음
zh_hans: 当前帧没有关键姿势

source: None
de: Keine
es: Ninguna
fr: Aucune
ja: なし
ko: 없음
zh_hans: 无

source: Nothing. A function that returns no value.
de: Nichts. Eine Funktion, die keinen Wert zurückgibt.
es: Nada. Una función que no devuelve ningún valor.
fr: Rien. Une fonction qui ne renvoie aucune valeur.
ja: なし。値を返さない関数。
ko: 없음. 값을 반환하지 않는 함수입니다.
zh_hans: 无。不返回任何值的函数。

source: On-screen control shortcuts
de: Kurzbefehle für Bildschirmsteuerung
es: Atajos de controles en pantalla
fr: Raccourcis des contrôles à l'écran
ja: オンスクリーンコントロールのショートカット
ko: 화면 컨트롤 단축키
zh_hans: 屏幕控件快捷键

source: Open-hand move cursor.
de: Verschieben-Cursor (offene Hand).
es: Cursor de mover (mano abierta).
fr: Curseur de déplacement (main ouverte).
ja: 移動カーソル（開いた手）。
ko: 이동 커서(펼친 손)입니다.
zh_hans: 移动光标（张开的手）。

source: Opt a point/position handle out of the default Cmd-held snap.
de: Schließt einen Punkt- oder Positionsgriff vom standardmäßigen Einrasten (Cmd) aus.
es: Excluye un controlador de punto o posición del ajuste con Cmd predeterminado.
fr: Exclut une poignée de point ou de position de l'aimantation par défaut (Cmd).
ja: ポイントまたは位置ハンドルを既定の Cmd スナップから除外します。
ko: 점 또는 위치 핸들을 기본 Cmd 스냅에서 제외합니다.
zh_hans: 将点或位置手柄从默认的 Cmd 吸附中排除。

source: Pick %@
de: %@ übernehmen
es: Seleccionar %@
fr: Prélever %@
ja: %@を取得
ko: %@ 선택
zh_hans: 拾取%@

source: Pick from frame
de: Aus Bild übernehmen
es: Seleccionar del fotograma
fr: Prélever dans l'image
ja: 画面から取得
ko: 화면에서 선택
zh_hans: 从画面拾取

source: Sample foliage
de: Laub messen
es: Muestrear vegetación
fr: Échantillonner le feuillage
ja: 緑をサンプル
ko: 초목 샘플링
zh_hans: 取样植物

source: Sample grey
de: Grau messen
es: Muestrear gris
fr: Échantillonner le gris
ja: グレーをサンプル
ko: 회색 샘플링
zh_hans: 取样灰色

source: Sample skin
de: Haut messen
es: Muestrear piel
fr: Échantillonner la peau
ja: 肌をサンプル
ko: 피부 샘플링
zh_hans: 取样肤色

source: Sample sky
de: Himmel messen
es: Muestrear cielo
fr: Échantillonner le ciel
ja: 空をサンプル
ko: 하늘 샘플링
zh_hans: 取样天空

source: Skin is clearly too pink.
de: Die Haut ist deutlich zu rosa.
es: La piel tira claramente a rosa.
fr: La peau tire nettement trop vers le rose.
ja: 肌が明らかにピンクすぎます。
ko: 피부색이 확실히 너무 분홍빛입니다.
zh_hans: 肤色明显偏粉。

source: Skin is clearly too yellow.
de: Die Haut ist deutlich zu gelb.
es: La piel tira claramente a amarillo.
fr: La peau tire nettement trop vers le jaune.
ja: 肌が明らかに黄色すぎます。
ko: 피부색이 확실히 너무 노랗습니다.
zh_hans: 肤色明显偏黄。

source: Skin is slightly too pink.
de: Die Haut ist etwas zu rosa.
es: La piel tira un poco a rosa.
fr: La peau tire un peu trop vers le rose.
ja: 肌がややピンクすぎます。
ko: 피부색이 약간 너무 분홍빛입니다.
zh_hans: 肤色略微偏粉。

source: Skin is slightly too yellow.
de: Die Haut ist etwas zu gelb.
es: La piel tira un poco a amarillo.
fr: La peau tire un peu trop vers le jaune.
ja: 肌がやや黄色すぎます。
ko: 피부색이 약간 너무 노랗습니다.
zh_hans: 肤色略微偏黄。

source: Skin looks right.
de: Die Haut sieht richtig aus.
es: La piel se ve bien.
fr: La peau est correcte.
ja: 肌は良好です。
ko: 피부색이 적절합니다.
zh_hans: 肤色正常。

source: Sky is clearly too green.
de: Der Himmel ist deutlich zu grün.
es: El cielo tira claramente a verde.
fr: Le ciel tire nettement trop vers le vert.
ja: 空が明らかに緑すぎます。
ko: 하늘색이 확실히 너무 초록빛입니다.
zh_hans: 天空明显偏绿。

source: Sky is clearly too purple.
de: Der Himmel ist deutlich zu violett.
es: El cielo tira claramente a púrpura.
fr: Le ciel tire nettement trop vers le violet.
ja: 空が明らかに紫すぎます。
ko: 하늘색이 확실히 너무 보랏빛입니다.
zh_hans: 天空明显偏紫。

source: Sky is slightly too green.
de: Der Himmel ist etwas zu grün.
es: El cielo tira un poco a verde.
fr: Le ciel tire un peu trop vers le vert.
ja: 空がやや緑すぎます。
ko: 하늘색이 약간 너무 초록빛입니다.
zh_hans: 天空略微偏绿。

source: Sky is slightly too purple.
de: Der Himmel ist etwas zu violett.
es: El cielo tira un poco a púrpura.
fr: Le ciel tire un peu trop vers le violet.
ja: 空がやや紫すぎます。
ko: 하늘색이 약간 너무 보랏빛입니다.
zh_hans: 天空略微偏紫。

source: Sky looks right.
de: Der Himmel sieht richtig aus.
es: El cielo se ve bien.
fr: Le ciel est correct.
ja: 空は良好です。
ko: 하늘색이 적절합니다.
zh_hans: 天空颜色正常。

source: The controls this puck drives are listed here.
de: Die Regler, die dieser Steuerpunkt bewegt, werden hier aufgeführt.
es: Aquí se muestran los controles que mueve este punto de control.
fr: Les paramètres pilotés par ce point de contrôle sont indiqués ici.
ja: このコントロールポイントが操作するコントロールがここに表示されます。
ko: 이 컨트롤 포인트가 조절하는 컨트롤이 여기에 표시됩니다.
zh_hans: 此控制点所控制的参数将显示在此处。

source: Per-field units for #multi: % or px.
de: Einheiten pro Feld für #multi: % oder px.
es: Unidades por campo para #multi: % o px.
fr: Unités par champ pour #multi : % ou px.
ja: #multi のフィールドごとの単位: % または px。
ko: #multi 의 필드별 단위: % 또는 px.
zh_hans: #multi 每个字段的单位：% 或 px。

source: Pin a ring centre to a #point control.
de: Verankert die Ringmitte an einem #point-Steuerelement.
es: Fija el centro de un anillo a un control #point.
fr: Fixe le centre d'un anneau à une commande #point.
ja: リングの中心を #point コントロールに固定します。
ko: 링 중심을 #point 컨트롤에 고정합니다.
zh_hans: 将环心固定到某个 #point 控件。

source: Plasma background
de: Plasma-Hintergrund
es: Fondo de plasma
fr: Arrière-plan plasma
ja: プラズマ背景
ko: 플라즈마 배경
zh_hans: 等离子背景

source: Playback time of each input.
de: Wiedergabezeit jeder Eingabe.
es: Tiempo de reproducción de cada entrada.
fr: Temps de lecture de chaque entrée.
ja: 各入力の再生時間。
ko: 각 입력의 재생 시간입니다.
zh_hans: 每个输入的播放时间。

source: Point look: hollow, square, dot or arc.
de: Punkt-Aussehen: hollow, square, dot oder arc.
es: Aspecto del punto: hollow, square, dot o arc.
fr: Apparence du point : hollow, square, dot ou arc.
ja: ポイントの見た目。hollow、square、dot、arc。
ko: 포인트 모양입니다. hollow, square, dot, arc.
zh_hans: 点的外观：hollow、square、dot 或 arc。

source: Point look: hollow, square, dot or position.
de: Punkt-Aussehen: hollow, square, dot oder position.
es: Aspecto del punto: hollow, square, dot o position.
fr: Apparence du point : hollow, square, dot ou position.
ja: ポイントの見た目。hollow、square、dot、position。
ko: 포인트 모양입니다. hollow, square, dot, position.
zh_hans: 点的外观：hollow、square、dot 或 position。

source: Pointer position and clicks, xy is the position.
de: Zeigerposition und Klicks, xy ist die Position.
es: Posición del puntero y clics; xy es la posición.
fr: Position du pointeur et clics ; xy est la position.
ja: ポインタの位置とクリック。xy が位置。
ko: 포인터 위치와 클릭으로, xy 가 위치입니다.
zh_hans: 指针位置和点击，xy 为位置。

source: Pointing-hand cursor.
de: Zeigende-Hand-Cursor.
es: Cursor de mano que señala.
fr: Curseur main pointant.
ja: 指差しカーソル。
ko: 가리키는 손 커서입니다.
zh_hans: 指向手光标。

source: Radians to degrees.
de: Bogenmaß in Grad.
es: Radianes a grados.
fr: Radians en degrés.
ja: ラジアンから度へ。
ko: 라디안을 도로 변환합니다.
zh_hans: 弧度转度。

source: Reacts to sound, binding a clip's frequency spectrum.
de: Reagiert auf Ton und bindet das Frequenzspektrum eines Clips.
es: Reacciona al sonido, vinculando el espectro de frecuencias de un clip.
fr: Réagit au son en liant le spectre de fréquences d'un plan.
ja: 音に反応し、クリップの周波数スペクトルを結び付けます。
ko: 소리에 반응하여 클립의 주파수 스펙트럼을 연결합니다.
zh_hans: 对声音作出反应，绑定片段的频谱。

source: Read a pixel at a chosen blur level.
de: Liest ein Pixel auf einer gewählten Unschärfestufe.
es: Lee un píxel en un nivel de desenfoque elegido.
fr: Lit un pixel à un niveau de flou choisi.
ja: 指定したぼかしレベルでピクセルを読み取ります。
ko: 선택한 흐림 레벨에서 픽셀을 읽습니다.
zh_hans: 在选定的模糊级别读取像素。

source: Read a pixel from an image at uv, 0 to 1.
de: Liest ein Pixel aus einem Bild bei uv, 0 bis 1.
es: Lee un píxel de una imagen en uv, de 0 a 1.
fr: Lit un pixel d'une image à uv, de 0 à 1.
ja: 画像から uv（0〜1）の位置のピクセルを読み取ります。
ko: 이미지에서 uv(0에서 1) 위치의 픽셀을 읽습니다.
zh_hans: 从图像中读取 uv（0 到 1）处的像素。

source: Red
de: Rot
es: Rojo
fr: Rouge
ja: 赤
ko: 빨강
zh_hans: 红

source: Repeat a block a set number of times.
de: Wiederholt einen Block eine festgelegte Anzahl von Malen.
es: Repite un bloque un número determinado de veces.
fr: Répète un bloc un nombre défini de fois.
ja: ブロックを決められた回数だけ繰り返します。
ko: 블록을 정해진 횟수만큼 반복합니다.
zh_hans: 将代码块重复固定的次数。

source: Repeat a block while a condition holds.
de: Wiederholt einen Block, solange eine Bedingung gilt.
es: Repite un bloque mientras se cumpla una condición.
fr: Répète un bloc tant qu'une condition est vraie.
ja: 条件が成り立つ間ブロックを繰り返します。
ko: 조건이 유지되는 동안 블록을 반복합니다.
zh_hans: 当条件成立时重复代码块。

source: Republish required
de: Neu veröffentlichen
es: Volver a publicar
fr: À republier
ja: 再公開が必要
ko: 다시 게시 필요
zh_hans: 需要重新发布

source: Resize the pattern
de: Größe des Musters ändern
es: Cambia el tamaño del patrón
fr: Redimensionnez le motif
ja: パターンのサイズを変更
ko: 패턴 크기 조절
zh_hans: 调整图案大小

source: Rotate the pattern
de: Muster drehen
es: Gira el patrón
fr: Faites pivoter le motif
ja: パターンを回転
ko: 패턴을 회전
zh_hans: 旋转图案

source: Round down.
de: Abrunden.
es: Redondear hacia abajo.
fr: Arrondir à l'inférieur.
ja: 切り捨て。
ko: 내림합니다.
zh_hans: 向下取整。

source: Round up.
de: Aufrunden.
es: Redondear hacia arriba.
fr: Arrondir au supérieur.
ja: 切り上げ。
ko: 올림합니다.
zh_hans: 向上取整。

source: Run a block only when a condition is true.
de: Führt einen Block nur aus, wenn eine Bedingung wahr ist.
es: Ejecuta un bloque solo cuando una condición es verdadera.
fr: Exécute un bloc uniquement lorsqu'une condition est vraie.
ja: 条件が真のときだけブロックを実行します。
ko: 조건이 참일 때만 블록을 실행합니다.
zh_hans: 仅当条件为真时运行代码块。

source: Seconds since the previous frame.
de: Sekunden seit dem vorherigen Bild.
es: Segundos desde el fotograma anterior.
fr: Secondes depuis l'image précédente.
ja: 前のフレームからの秒数。
ko: 이전 프레임 이후의 시간(초)입니다.
zh_hans: 自上一帧以来的秒数。

source: Show the graded frame beside the original. Drag the divider in the preview to move the split.
de: Zeigt das bearbeitete Bild neben dem Original. Ziehe die Trennlinie in der Vorschau, um die Teilung zu verschieben.
es: Muestra el fotograma corregido junto al original. Arrastra el divisor en la previsualización para mover la división.
fr: Affiche l'image étalonnée à côté de l'originale. Faites glisser la séparation dans l'aperçu pour déplacer le partage.
ja: 補正後の画面を元の画面と並べて表示します。プレビュー内の分割線をドラッグすると分割位置が変わります。
ko: 보정된 화면을 원본과 나란히 표시합니다. 미리보기의 분할선을 드래그하면 분할 위치가 바뀝니다.
zh_hans: 将调色后的画面与原始画面并排显示。拖动预览中的分割线可移动分割位置。

source: Sine, angle in radians.
de: Sinus, Winkel im Bogenmaß.
es: Seno, ángulo en radianes.
fr: Sinus, angle en radians.
ja: サイン。角度はラジアン。
ko: 사인, 각도는 라디안입니다.
zh_hans: 正弦，角度以弧度表示。

source: Spin around the x axis.
de: Um die x-Achse drehen.
es: Gira alrededor del eje x.
fr: Tourne autour de l'axe x.
ja: x軸の周りに回転。
ko: x축을 중심으로 회전합니다.
zh_hans: 绕 x 轴旋转。

source: Spin around the y axis.
de: Um die y-Achse drehen.
es: Gira alrededor del eje y.
fr: Tourne autour de l'axe y.
ja: y軸の周りに回転。
ko: y축을 중심으로 회전합니다.
zh_hans: 绕 y 轴旋转。

source: Spin flat, like a dial.
de: Flach drehen, wie ein Drehregler.
es: Gira en plano, como un dial.
fr: Tourne à plat, comme une molette.
ja: ダイヤルのように平面で回転。
ko: 다이얼처럼 평면으로 회전합니다.
zh_hans: 像转盘一样平面旋转。

source: Split
de: Teilen
es: Dividir
fr: Diviser
ja: 分割
ko: 분할
zh_hans: 分屏

source: Square root.
de: Quadratwurzel.
es: Raíz cuadrada.
fr: Racine carrée.
ja: 平方根。
ko: 제곱근입니다.
zh_hans: 平方根。

source: Starting value.
de: Startwert.
es: Valor inicial.
fr: Valeur de départ.
ja: 初期値。
ko: 시작 값입니다.
zh_hans: 起始值。

source: Take control of transparency, to mask part of the frame so a lower clip shows through.
de: Übernimm die Transparenz, um einen Teil des Bildes zu maskieren, damit ein darunterliegender Clip durchscheint.
es: Toma el control de la transparencia para enmascarar parte del fotograma y dejar ver un clip inferior.
fr: Prenez le contrôle de la transparence pour masquer une partie de l'image et laisser apparaître un plan inférieur.
ja: 透明度を自分で制御し、フレームの一部をマスクして下のクリップを透かせます。
ko: 투명도를 직접 제어하여 프레임의 일부를 마스킹해 아래 클립이 비쳐 보이게 합니다.
zh_hans: 自行控制透明度，遮罩画面的一部分，让下方片段透出。

source: Tangent, angle in radians.
de: Tangens, Winkel im Bogenmaß.
es: Tangente, ángulo en radianes.
fr: Tangente, angle en radians.
ja: タンジェント。角度はラジアン。
ko: 탄젠트, 각도는 라디안입니다.
zh_hans: 正切，角度以弧度表示。

source: The angle of a direction, y and x.
de: Der Winkel einer Richtung, y und x.
es: El ángulo de una dirección, y y x.
fr: L'angle d'une direction, y et x.
ja: 方向の角度（y と x）。
ko: 방향의 각도(y 와 x)입니다.
zh_hans: 某个方向的角度（y 和 x）。

source: The axes a rotate control spins: x, y, z.
de: Die Achsen, um die ein Rotate dreht: x, y, z.
es: Los ejes que gira un control rotate: x, y, z.
fr: Les axes qu'un contrôle rotate fait tourner : x, y, z.
ja: ローテートが回す軸。x、y、z。
ko: 회전 컨트롤이 도는 축입니다. x, y, z.
zh_hans: 旋转控件转动的轴：x、y、z。

source: The block to run when the if was false.
de: Der Block, der ausgeführt wird, wenn das if falsch war.
es: El bloque que se ejecuta cuando el if fue falso.
fr: Le bloc à exécuter lorsque le if était faux.
ja: if が偽だった場合に実行するブロック。
ko: if 가 거짓일 때 실행할 블록입니다.
zh_hans: 当 if 为假时运行的代码块。

source: The bottom-left corner.
de: Die untere linke Ecke.
es: La esquina inferior izquierda.
fr: Le coin inférieur gauche.
ja: 左下の角。
ko: 왼쪽 아래 모서리입니다.
zh_hans: 左下角。

source: The bottom-right corner.
de: Die untere rechte Ecke.
es: La esquina inferior derecha.
fr: Le coin inférieur droit.
ja: 右下の角。
ko: 오른쪽 아래 모서리입니다.
zh_hans: 右下角。

source: The box interior ignores drags.
de: Das Innere der Box ignoriert Ziehen.
es: El interior de la caja ignora los arrastres.
fr: L'intérieur de la boîte ignore les glissements.
ja: ボックス内部はドラッグを無視。
ko: 상자 내부는 드래그를 무시합니다.
zh_hans: 方框内部忽略拖动。

source: The centre of the frame.
de: Die Bildmitte.
es: El centro del fotograma.
fr: Le centre de l'image.
ja: フレームの中心。
ko: 프레임의 중심입니다.
zh_hans: 画面的中心。

source: The control kind: point, position, ring, box or rotate.
de: Die Steuerelement-Art: point, position, ring, box oder rotate.
es: El tipo de control: point, position, ring, box o rotate.
fr: Le type de contrôle : point, position, ring, box ou rotate.
ja: コントロールの種類。point、position、ring、box、rotate。
ko: 컨트롤 종류입니다. point, position, ring, box, rotate.
zh_hans: 控件类型：point、position、ring、box 或 rotate。

source: The control kind: point, ring, box or rotate.
de: Die Steuerelement-Art: point, ring, box oder rotate.
es: El tipo de control: point, ring, box o rotate.
fr: Le type de contrôle : point, ring, box ou rotate.
ja: コントロールの種類。point、ring、box、rotate。
ko: 컨트롤 종류입니다. point, ring, box, rotate.
zh_hans: 控件类型：point、ring、box 或 rotate。

source: The cross product, 3D.
de: Das Kreuzprodukt, 3D.
es: El producto vectorial, 3D.
fr: Le produit vectoriel, 3D.
ja: 外積（3D）。
ko: 외적(3D)입니다.
zh_hans: 叉积（3D）。

source: The current date and time.
de: Das aktuelle Datum und die Uhrzeit.
es: La fecha y hora actuales.
fr: La date et l'heure actuelles.
ja: 現在の日付と時刻。
ko: 현재 날짜와 시간입니다.
zh_hans: 当前日期和时间。

source: The current frame number.
de: Die aktuelle Bildnummer.
es: El número de fotograma actual.
fr: Le numéro de l'image actuelle.
ja: 現在のフレーム番号。
ko: 현재 프레임 번호입니다.
zh_hans: 当前帧编号。

source: The cursor shown over the control.
de: Der Cursor über dem Steuerelement.
es: El cursor mostrado sobre el control.
fr: Le curseur affiché sur le contrôle.
ja: コントロール上に表示されるカーソル。
ko: 컨트롤 위에 표시되는 커서입니다.
zh_hans: 控件上显示的光标。

source: The cursor shown over the handle.
de: Der über dem Griff angezeigte Cursor.
es: El cursor que se muestra sobre el controlador.
fr: Le curseur affiché au-dessus de la poignée.
ja: ハンドル上に表示されるカーソル。
ko: 핸들 위에 표시되는 커서입니다.
zh_hans: 悬停在控制柄上时显示的光标。

source: The distance between two points.
de: Der Abstand zwischen zwei Punkten.
es: La distancia entre dos puntos.
fr: La distance entre deux points.
ja: 2点間の距離。
ko: 두 점 사이의 거리입니다.
zh_hans: 两点之间的距离。
